#include "main.h"

using namespace res;

static_assert(sizeof(item) == sizeof(int), "Not valid items count");
struct ammo_info {
	short			ac;
	char			dr;
	char			dam_mul, dam_div;
};
struct drug_info {
	variant			id;
	short			bonus;
	unsigned		interval[3];
};
struct armor_info {
	short			ac;
	unsigned short	threshold[Explosive + 1];
	unsigned short	resistance[Explosive + 1];
	res::tokens		dress[2];
};
struct item_info {
	const char*		name;
	unsigned short	frame[4];
	unsigned short	sound[2];
	unsigned short	weight;
	unsigned short	cost;
	attack_info		weapon;
	armor_info		armor;
	ammo_info		ammunition;
	const char*		description;
};
static item_info item_data[] = {{"Нет предмета"},
{"Металлическая Броня", {1, 33, 0}, {48}, 35, 1100, {}, {10, {4, 6, 4, 4, 0, 0, 4}, {30, 75, 10, 20, 0, 500, 25}, {HMMETL, HFMETL}}},
{"10мм ПП", {2, 44, 6}, {48}, 5, 1000, {{}, SmallGuns, {5, 12}, 4, 30, {Ammo10mm}}},
{"Кожаная броня", {3, 29, 0}, {48}, 8, 700, {}, {15, {2, 0, 0, 0, 0, 0, 0}, {25, 20, 20, 10, 30, 500, 20}, {HMLTHR, HFLTHR}}},
{"10мм Пистолет", {4, 34, 5}, {48}, 3, 250, {{}, SmallGuns, {5, 12}, 3, 12, {Ammo10mm}}},
{"Кувалда", {5, 40, 3}, {48}, 12, 120, {{}, SmallGuns, {4, 9}, 6, 0}},
{"Пулемет", {6, 31, 9}, {48}, 28, 3800, {{}, SmallGuns, {7, 11}, 7, 120}},
{"Базука", {7, 37, 10}, {48}, 15, 2300, {{}, SmallGuns, {35, 100}, 6, 1}},
{"Взрывная ракета", {28, 38, 0}, {48}, 3, 200, },
{"Дубинка", {9, 16, 2}, {48}, 3, 30, {{}, SmallGuns, {1, 6}, 3, 0}},
{"Огнемет", {10, 24, 8}, {48}, 18, 2000, {{}, SmallGuns, {45, 90}, 6, 5}},
{"Охотничье Ружье", {23, 36, 7}, {48}, 9, 1000, {{}, SmallGuns, {8, 20}, 5, 10}},
{"Нож", {96, 28, 1}, {51}, 1, 40, {{}, SmallGuns, {1, 6}, 2, 0}},
{"Копье", {13, 42, 4}, {48}, 4, 80, {{}, SmallGuns, {3, 10}, 4, 0}},
{"Моторизованая Броня", {15, 35, 0}, {48}, 85, 12500, {}, {25, {12, 18, 12, 10, 12, 15, 20}, {40, 80, 60, 40, 40, 500, 50}, {HAPOWR, HAPOWR}}},
{"Плазменная Винтовка", {14, 24, 8}, {48}, 12, 4000, {{}, SmallGuns, {30, 65}, 6, 10}},
{"Лазерный Пистолет", {21, 34, 5}, {48}, 4, 1400, {{}, SmallGuns, {10, 22}, 3, 12}},
{"Боевая Броня", {16, 17, 0}, {48}, 20, 6500, {}, {20, {5, 8, 4, 4, 2, 0, 6}, {40, 60, 30, 50, 50, 500, 40}, {HMCMBT, HFCMBT}}},
{"Пустынный Орел .44", {18, 34}, {48}, 4, 800, },
{"Камень", {17, 53}, {48}, 1, 0, },
{"Фомка", {19, 16}, {48}, 5, 65, },
{"Металлические Кастеты", {140, 47}, {48}, 1, 40, },
{"14мм Пистолет", {22, 44}, {48}, 4, 1100, },
{"Десантная Винтовка", {11, 36}, {48}, 7, 1300, },
{"Плазменный Пистолет", {24, 34}, {48}, 4, 2750, },
{"Граната", {25, 122}, {48}, 1, 150, },
{"Граната (Плазма)", {26, 122}, {48}, 1, 300, },
{"Граната (Пульс)", {27, 122}, {48}, 1, 250, },
{"Лазер Гатлинга", {41, 31}, {48}, 24, 7500, },
{"10мм ПСЦТ", {31, 1}, {48}, 1, 75, },
{"10мм БП", {30, 1}, {48}, 1, 100, },
{".44 Магнум ПСЦТ", {34, 1}, {48}, 1, 50, },
{"Топливо для огнемета", {74, 43}, {48}, 10, 250, },
{"14мм БП", {32, 1}, {48}, 1, 150, },
{".223 ЦМ", {35, 1}, {48}, 2, 200, },
{"5мм ПСЦТ", {39, 1}, {48}, 1, 100, },
{"5мм БП", {38, 1}, {48}, 1, 120, },
{"Ракета БП", {8, 38}, {48}, 3, 400, },
{"Малый Энерго-Блок", {36, 4}, {48}, 3, 400, },
{"Атомная Батарейка", {37, 4}, {48}, 5, 1000, },
{"Стимулятор", {115, 15}, {48}, 0, 175, },
{"Деньги", {40, 3}, {48}, 0, 1, },
{"Ледник", {50, 27}, {67}, 30, 0, },
{"Ледник", {50, 26}, {67}, 30, 0, },
{"Метательный Нож", {78, 28}, {52}, 1, 100, },
{"Сумка", {138, 3}, {48}, 3, 25, },
{"Аптечка", {42, 15}, {48}, 2, 200, },
{"Рад-Эвей", {48, 15}, {48}, 0, 500, },
{"Противоядие", {44, 15}, {48}, 1, 50, },
{"Резервный Предмет", {45, 173}, {48}, 10, 0, },
{"Динамит", {46, 23}, {48}, 5, 500, },
{"Счетчик Гейгера", {47, 121}, {48}, 4, 650, },
{"Ментат", {72, 15}, {48}, 0, 280, },
{"Невидимка", {49, 14}, {48}, 3, 1800, },
{"Водяной чип", {84, 48}, {48}, 2, 1, },
{"Собачьи Метки", {73, 41}, {48}, 0, 50, },
{"Жучок", {53, 41}, {48}, 2, 50, },
{"Пленка", {75, 14}, {48}, 4, 40, },
{"Датчик движения", {67, 123}, {48}, 7, 800, },
{"Фрукт", {61, 14}, {48}, 1, 10, },
{"Дипломат", {52, 5}, {48}, 5, 35, },
{"Большая Научная Книга", {88, 13}, {48}, 5, 400, },
{"Кожаная Куртка", {77, 30}, {48}, 5, 250, {}, {8, {0, 0, 0, 0, 0, 0, 0}, {20, 20, 10, 10, 30, 500, 20}, {HMMAXX, HFMAXX}}},
{"Инструмент", {54, 41}, {48}, 1, 200, },
{"Учебник", {55, 13}, {48}, 2, 130, },
{"Электронная отмычка", {57, 118}, {48}, 2, 375, },
{"Картина", {58, 119}, {48}, 12, 300, },
{"Вспышка", {59, 46}, {48}, 1, 35, },
{"Мед Книжка", {60, 13}, {48}, 2, 175, },
{"Игуана-на-палочке", {62, 41}, {48}, 1, 20, },
{"Ключ", {63, 41}, {48}, 0, 4, },
{"Кольцо для ключей", {64, 41}, {48}, 0, 4, },
{"Отмычки", {66, 41}, {48}, 1, 150, },
{"Пластиковая Взрывчатка", {70, 125}, {48}, 4, 850, },
{"Книга скаута", {71, 13}, {48}, 3, 200, },
{"Баффоут", {45, 15}, {48}, 0, 200, },
{"Часы", {306, 173}, {48}, 1, 0, },
{"Мотор", {68, 32}, {48}, 14, 210, },
{"Рюкзак", {69, 2}, {48}, 5, 100, },
{"Докторская сумка", {56, 117}, {48}, 5, 300, },
{"Xвост Скорпиона", {90, 39}, {48}, 20, 10, },
{"Сумка", {138, 3}, {48}, 3, 25, },
{"Винтовка", {95, 36}, {48}, 5, 800, },
{"12 Винтовочных Патронов", {91, 1}, {48}, 1, 225, },
{"Ключ Красного Допуска", {79, 41}, {48}, 1, 10, },
{"Ключ Синего Допуска", {80, 41}, {48}, 1, 10, },
{"Мусор", {81, 49}, {48}, 12, 40, },
{"Золотой Медальон", {82, 41}, {48}, 1, 400, },
{"Радио", {83, 6}, {48}, 6, 350, },
{"Зажигалка", {85, 41}, {48}, 0, 100, },
{"Пушки и Пули", {86, 13}, {48}, 2, 425, },
{"Игуана-на-палочке", {87, 41}, {48}, 1, 8, },
{"Магнитофон", {89, 14}, {48}, 5, 80, },
{"Ключ", {94, 41}, {48}, 0, 25, },
{"Нюка-Кола", {93, 116}, {48}, 0, 3, },
{"Рад X", {43, 15}, {48}, 0, 300, },
{"Психо", {92, 15}, {48}, 0, 400, },
{".44 магнум ЦМ", {33, 1}, {48}, 2, 50, },
{"Урна", {97, 127}, {48}, 6, 130, },
{"Робы", {98, 52}, {48}, 10, 90, {}, {5, {0, 0, 0, 0, 0, 0, 0}, {20, 25, 10, 10, 40, 500, 20}, {HAROBE, HAROBE}}},
{"Рука Танглера", {99, 128}, {48}, 3, 200, },
{"Супермолот", {100, 40}, {48}, 12, 3750, },
{"Потрошитель", {102, 28}, {48}, 2, 900, },
{"Цветок", {101, 120}, {48}, 1, 5, },
{"Лазерная Винтовка", {103, 24}, {48}, 12, 5000, },
{"Ожерелье", {104, 41}, {48}, 2, 700, },
{"Инопланетный Бластер", {105, 34}, {48}, 2, 10000, },
{"9ти мм пули", {106, 1}, {48}, 2, 100, },
{"9мм Маузер", {107, 34}, {48}, 3, 1500, },
{"Психический нейтрализатор", {108, 14}, {48}, 3, 1000, },
{"Пиво", {117, 116}, {48}, 0, 5, },
{"Бузз", {121, 116}, {48}, 1, 10, },
{"Фляга", {109, 41}, {48}, 2, 25, },
{"Веревка", {110, 126}, {48}, 10, 25, },
{"Карта Доступа", {111, 41}, {48}, 1, 25, },
{"Значок ДX", {112, 41}, {48}, 1, 400, },
{"Значок ДX", {113, 41}, {48}, 1, 12, },
{"Снайперская Винтовка", {114, 36}, {48}, 8, 2200, },
{"Супер Стимпакет", {29, 15}, {48}, 1, 350, },
{"Коктейль Молотова", {118, 116}, {48}, 1, 50, },
{"Тыкалка для скота", {129, 16}, {48}, 3, 600, },
{"Ружье Ред Райдер", {119, 36}, {48}, 5, 200, },
{"Ружье Ред Райдер ББ СС", {120, 36}, {48}, 5, 3500, },
{"ББы", {116, 1}, {48}, 2, 20, },
{"Лента Братства", {75, 41}, {48}, 1, 70, },
{"ФЕБ диск.", {75, 41}, {48}, 1, 200, },
{"Диск Безопасности", {75, 41}, {48}, 1, 50, },
{"Диск Эксперимента Альфа", {75, 41}, {48}, 1, 50, },
{"Диск Эксперимента Дельта", {75, 41}, {48}, 1, 50, },
{"Диск эксперимента ВРее", {75, 41}, {48}, 1, 75, },
{"Код Четси Братства", {0, 173}, {48}, 1, 50, },
{"Передачи Мутантов", {75, 41}, {48}, 1, 125, },
{"Вспышка", {123, 46}, {48}, 1, 60, },
{"Динамит", {122, 23}, {48}, 5, 500, },
{"Счетчик Гейгера", {124, 121}, {48}, 4, 650, },
{"Датчик движения", {125, 123}, {48}, 7, 800, },
{"Пластиковая Взрывчатка", {126, 125}, {48}, 4, 850, },
{"Невидимка", {127, 14}, {48}, 3, 1800, },
{"Танди", {128, 173}, {48}, 10, 600, },
{"История Братства", {75, 41}, {48}, 1, 50, },
{"История Максона", {75, 41}, {48}, 1, 50, },
{"Журнал Максона", {75, 41}, {48}, 1, 50, },
{"Незначительное излечение", {306, 173}, {48}, 0, 25, },
{"Среднее Излечение", {306, 173}, {48}, 0, 50, },
{"Мощное Исцеление", {306, 173}, {48}, 0, 100, },
{"Карта Безопасности", {130, 41}, {48}, 0, 40, },
{"Переключатель Полей", {131, 41}, {48}, 1, 0, },
{"Ключ Желтого Допуска", {132, 41}, {48}, 0, 40, },
{"Маленькая статуэтка", {133, 6}, {48}, 3, 300, },
{"Журнал Кошачья Лапка", {134, 13}, {48}, 1, 5, },
{"Коробка Лапши", {135, 41}, {48}, 1, 35, },
{"Какая-то маленькая пыльная коробка", {136, 41}, {48}, 2, 20, },
{"Инструкция по экплуатации", {137, 13}, {48}, 2, 200, },
{"Маленький механизм", {139, 41}, {48}, 1, 150, },
{"Записи Xранилища", {75, 41}, {48}, 1, 50, },
{"Код Безопасности Военной Базы", {75, 41}, {48}, 1, 0, },
{"Укрепленная Броня", {15, 35}, {48}, 100, 15000, {}, {25, {13, 19, 14, 13, 13, 0, 20}, {50, 90, 70, 50, 50, 505, 60}, {HAPOWR, HAPOWR}}},
{"Турбо Плазменная Винтовка", {143, 24}, {48}, 14, 10000, },
{"Кастеты с Шипами", {20, 47}, {48}, 1, 250, },
{"Мощный Кулак", {141, 47}, {48}, 7, 2200, },
{"Боевой Нож", {142, 28}, {48}, 2, 165, },
{"Xимические Журналы", {88, 13}, {48}, 5, 100, },
{"Передача Регулятора", {75, 41}, {48}, 1, 25, },
{"Броня Братства", {144, 17}, {48}, 25, 4800, {}, {20, {8, 8, 7, 7, 6, 0, 8}, {40, 70, 50, 60, 60, 500, 40}, {HMCMBT, HFCMBT}}},
{"Броня Тесла", {145, 33}, {48}, 35, 4500, {}, {15, {4, 19, 4, 10, 12, 0, 4}, {20, 90, 10, 80, 80, 500, 20}, {HMMETL, HFMETL}}},
{".223 Пистолет", {146, 44}, {48}, 5, 3500, },
{"Боевая Винтовка", {147, 36}, {48}, 10, 2750, },
{"Кости Анны", {148, 136}, {48}, 10, 0, },
{"Золотой Медальон Анны", {149, 41}, {48}, 1, 0, },
{"Элемент Контроля Топлива.", {150, 6}, {48}, 5, 0, },
{"Элемент Топливного Регулятора", {151, 14}, {48}, 5, 0, },
{"Дневной Пропуск", {152, 41}, {48}, 1, 0, },
{"Фальшивые Бумаги о Гражданстве", {153, 41}, {48}, 1, 0, },
{"Золотые Часы Корнелиуса", {154, 41}, {48}, 1, 0, },
{"Гидроэлектрическая Деталь", {155, 14}, {48}, 10, 0, },
{"Джет", {156, 15}, {48}, 0, 25, },
{"Противоядие от Джет", {157, 15}, {48}, 0, 25, },
{"ББ-Пушка Джонни", {158, 36}, {48}, 5, 200, },
{"Резиновые Сапоги", {159, 6}, {48}, 2, 0, },
{"Послание Слагов", {160, 41}, {48}, 1, 0, },
{"Крутые Вещички Смита", {161, 41}, {48}, 1, 0, },
{"Боевая Кожанная Куртка", {162, 30}, {48}, 7, 1000, {}, {18, {2, 0, 2, 0, 0, 0, 0}, {30, 20, 25, 10, 30, 500, 20}, {HMMAXX, HFMAXX}}},
{"Радио Вика", {163, 14}, {48}, 5, 50, },
{"Водяная Фляжка Вика", {164, 41}, {48}, 2, 0, },
{"X&К Ворон", {165, 36}, {48}, 5, 4750, },
{"Части робота", {166, 6}, {48}, 300, 0, },
{"Ракетница Робота", {167, 137}, {48}, 1, 0, },
{"Цветок Брок", {168, 139}, {48}, 0, 1, },
{"Корень Ксандер", {169, 140}, {48}, 0, 2, },
{"Целебный порошок", {170, 15}, {48}, 1, 20, },
{"Патроны Ракетного робота", {171, 138}, {48}, 10, 0, },
{"Признанный трофей", {97, 127}, {48}, 10, 2000, },
{"Шкура Гекко", {172, 14}, {48}, 2, 25, },
{"Золотая шкура Гекко", {173, 14}, {48}, 5, 125, },
{"Кремень", {174, 41}, {48}, 2, 5, },
{"Нейронный Интерфейс", {108, 6}, {48}, 3, 800, },
{"Заостренное Копье", {176, 42}, {48}, 4, 100, },
{"Глаз Диксона", {177, 155}, {48}, 1, 0, },
{"Глаз Клифтона", {178, 155}, {48}, 1, 0, },
{"Пушка Томми", {179, 36}, {48}, 7, 1200, },
{"Мясо вяленое", {180, 41}, {48}, 1, 5, },
{"Клешни Радскорпиона", {181, 142}, {48}, 10, 0, },
{"Дрова", {182, 141}, {48}, 10, 0, },
{"Снайперка для охоты", {183, 36}, {48}, 11, 1500, },
{"Топливная батарея автомобиля", {184, 6}, {48}, 10, 0, },
{"Лопата", {185, 143}, {48}, 10, 15, },
{"Оружие робота 1 ", {186, 144}, {48}, 1, 0, },
{"Оружие робота 2", {186, 144}, {48}, 1, 0, },
{"Боксерские перчатки", {187, 47}, {48}, 5, 250, },
{"Боксерские перчатки с кастетом", {338, 47}, {48}, 10, 300, },
{"Голодиск 13 Убежища", {75, 41}, {48}, 1, 200, },
{"Сырные Пуфы", {189, 41}, {48}, 1, 5, },
{"Xеклер П90с", {190, 44}, {48}, 8, 2500, },
{"Металлический шест", {191, 145}, {48}, 10, 5, },
{"Ключ Траппер-тауна", {63, 41}, {48}, 0, 0, },
{"Линейная винтовка", {193, 36}, {48}, 10, 200, },
{"Зип пушка", {192, 34}, {48}, 4, 150, },
{"Клавиатура", {194, 41}, {48}, 1, 0, },
{"Голодиск Гекко", {75, 41}, {48}, 1, 50, },
{"Голодиск Реактора", {75, 41}, {48}, 1, 50, },
{"Колода \"Трагических\" карт", {195, 41}, {48}, 1, 50, },
{"Желтая Ключ-карта Реактора", {132, 41}, {48}, 1, 25, },
{"Красная Ключ-карта Реактора", {79, 41}, {48}, 1, 25, },
{"Плазмопреобразователь", {196, 41}, {48}, 1, 200, },
{"Инструментальная Супер Аптечка", {197, 146}, {48}, 10, 1000, },
{"Талисман", {198, 41}, {48}, 1, 25, },
{"Гамма Галп Пиво", {199, 116}, {48}, 0, 5, },
{"Ром Роентген", {200, 116}, {48}, 0, 10, },
{"Часть Требуемой Формы", {201, 41}, {48}, 1, 10, },
{".44 Револьвер Магнум", {202, 34}, {48}, 5, 600, },
{"(Синяя упаковка) Презерватив", {203, 41}, {48}, 0, 2, },
{"(Зеленая упаковка) Презерватив", {204, 41}, {48}, 0, 2, },
{"(Красная упаковка) Презерватив", {205, 41}, {48}, 0, 2, },
{"Косметичка", {206, 41}, {48}, 1, 25, },
{"Пустой Гиподермик", {207, 41}, {48}, 1, 2, },
{"Свичблэйд", {208, 28}, {48}, 1, 50, },
{"Заостренный шест", {209, 42}, {48}, 3, 5, },
{"Кибернетический Мозг", {210, 155}, {48}, 8, 2000, },
{"Человеческий Мозг", {211, 155}, {48}, 5, 0, },
{"Мозг шимпанзе", {212, 155}, {48}, 4, 0, },
{"Ненормальный мозг", {213, 155}, {48}, 5, 0, },
{"Кости", {214, 41}, {48}, 0, 5, },
{"Утяжеленные кости", {215, 41}, {48}, 0, 20, },
{"Пасхальное яйцо", {216, 41}, {48}, 0, 1, },
{"Волшебный 8-Болл", {217, 41}, {48}, 1, 50, },
{"Мутагенная сыворотка", {218, 15}, {48}, 0, 0, },
{"Кошачья Лапка выпуск N5", {219, 13}, {48}, 0, 50, },
{"М3А1 Гризли SMG", {220, 44}, {48}, 7, 1750, },
{"Сердечные таблетки", {221, 15}, {48}, 0, 50, },
{"Отрава", {222, 15}, {48}, 0, 200, },
{"Саквояж Мура", {52, 5}, {48}, 5, 35, },
{"Саквояж Мура", {52, 5}, {48}, 5, 35, },
{"Голодиск Линетт", {75, 41}, {48}, 1, 50, },
{"Голодиск Вестина", {75, 41}, {48}, 1, 50, },
{"НКР Шпионский голодиск", {75, 41}, {48}, 1, 50, },
{"Записки Доктора", {223, 41}, {48}, 0, 0, },
{"Президентский пропуск", {224, 41}, {48}, 0, 0, },
{"Удостоверение Рэйнджера", {225, 41}, {48}, 1, 10, },
{"Карта Рэйнджера", {226, 41}, {48}, 1, 0, },
{"Улучшенная Силовая Броня", {227, 152}, {48}, 90, 20000, {}, {30, {15, 19, 16, 15, 15, 0, 20}, {55, 90, 70, 60, 60, 500, 65}, {HANPWR, HANPWR}}},
{"Усил. Силовая Броня МКII", {227, 152}, {48}, 100, 25000, {}, {35, {18, 19, 16, 18, 15, 0, 20}, {60, 90, 70, 60, 65, 500, 70}, {HANPWR, HANPWR}}},
{"Бозар", {228, 24}, {48}, 20, 5250, },
{"ФН ФАЛ", {229, 36}, {48}, 9, 1500, },
{"Xеклер Г11", {230, 44}, {48}, 8, 6500, },
{"XЛ70Е3", {231, 36}, {48}, 9, 3000, },
{"Панкор Джекхаммер", {232, 36}, {48}, 12, 5500, },
{"Пулемет легкой поддержки", {233, 24}, {48}, 20, 4750, },
{"Компьютерный Голосовой Модуль", {234, 41}, {48}, 1, 3000, },
{".45 Калибр", {236, 1}, {48}, 1, 75, },
{"2мм ЕС", {235, 1}, {48}, 1, 400, },
{"4.7 мм безотказные", {237, 1}, {48}, 1, 600, },
{"9 мм", {238, 1}, {48}, 1, 100, },
{"XН Нидлер Картридж", {240, 1}, {48}, 1, 250, },
{"XН АП Нидлер Картридж", {239, 1}, {48}, 1, 300, },
{"7.62 мм", {241, 1}, {48}, 1, 150, },
{"Двигатель робота", {68, 32}, {48}, 20, 50, },
{"Шип растения", {242, 153}, {48}, 0, 0, },
{"Г.Э.К.К.", {243, 154}, {48}, 10, 0, },
{"Коготь", {244, 160}, {48}, 1, 0, },
{"Коготь", {245, 161}, {48}, 1, 0, },
{"Ключ-карта 15 Убежища", {79, 41}, {48}, 1, 0, },
{"Компьютерные части с 15 Убежища", {246, 14}, {48}, 10, 100, },
{"Печенье", {247, 41}, {48}, 0, 0, },
{"Кожаная Броня Марк II", {250, 29}, {48}, 10, 1000, {}, {20, {3, 1, 1, 1, 1, 0, 1}, {25, 20, 25, 10, 40, 500, 25}, {HMLTHR, HFLTHR}}},
{"Металлическая Броня Марк II", {248, 33}, {48}, 35, 1900, {}, {15, {4, 7, 4, 4, 1, 0, 4}, {35, 80, 15, 25, 10, 500, 30}, {HMMETL, HFMETL}}},
{"Боевая Броня Марк II", {249, 17}, {48}, 25, 8000, {}, {25, {6, 9, 5, 5, 3, 0, 9}, {40, 65, 35, 50, 55, 500, 45}, {HMCMBT, HFCMBT}}},
{"Огнеметная смесь МКII ", {260, 43}, {48}, 10, 250, },
{"Шив", {275, 28}, {51}, 1, 2, },
{"Гаечный ключ", {280, 16}, {48}, 4, 65, },
{"Обрез", {278, 36}, {48}, 4, 800, },
{"Луисвильский Слюггер", {276, 16}, {48}, 4, 2700, },
{"М60", {266, 24}, {48}, 23, 3500, },
{"Пистолет Нидлер", {270, 34}, {48}, 4, 2200, },
{"Минипушка Авенджер", {253, 31}, {48}, 28, 5500, },
{"Солнечный Скорчер", {277, 34}, {48}, 5, 2000, },
{"Xеклер Г11Е", {263, 44}, {48}, 8, 8000, },
{"Винтовка Гаусса М72", {267, 36}, {48}, 9, 8250, },
{"Фазер", {271, 34}, {48}, 4, 7500, },
{"Пистолет Гаусса ППК12 ", {262, 34}, {48}, 5, 5250, },
{"Минипушка Виндикатора ", {279, 31}, {48}, 28, 15250, },
{"Импульсный пистолет ЮК32", {273, 34}, {35}, 5, 12500, },
{"Импульсная винтовка ЮК42Б", {274, 24}, {48}, 9, 17500, },
{".44 Магнум (Скоростная перезарядка)", {252, 34}, {48}, 5, 600, },
{"Супер погонщик скота", {255, 16}, {48}, 3, 600, },
{"Улучшенный Огнемет", {264, 24}, {48}, 19, 2000, },
{"Лазерная винтовка (Улучшенные Батареи)", {265, 24}, {48}, 12, 5000, },
{"Магнито-Лазерный Пистолет", {268, 34}, {48}, 4, 1400, },
{"ФН ФАЛ (Инфракрасный Прицел)", {261, 36}, {48}, 10, 2000, },
{"Пустынный Орел (Увел. Маг.)", {256, 34}, {48}, 4, 800, },
{"Штурмовая винтовка (Увел. Маг.)", {254, 36}, {48}, 8, 1300, },
{"Плазменный Пистолет (Увел. Емк.)", {272, 34}, {48}, 5, 2750, },
{"Мега Силовой Кулак", {269, 47}, {48}, 7, 2200, },
{"Полевая медаптечка ", {251, 15}, {48}, 2, 400, },
{"Парамедицинская аптечка", {257, 117}, {48}, 6, 600, },
{"Спецнабор Взломщика", {259, 41}, {48}, 1, 400, },
{"Электронный Взломщик МКII", {258, 118}, {48}, 2, 700, },
{"Канистра Смазки", {281, 155}, {48}, 3, 150, },
{"ID значок с конюшни", {282, 41}, {48}, 0, 0, },
{"Ключ от 15го Убежища", {318, 41}, {48}, 0, 0, },
{"Линзы", {283, 41}, {48}, 0, 50, },
{"Пустая Джет канистра", {284, 15}, {48}, 0, 0, },
{"Кислородный баллон", {285, 14}, {48}, 5, 20, },
{"Баллон с ядом", {286, 6}, {48}, 5, 0, },
{"Запчасти к Шахте ", {287, 14}, {48}, 10, 0, },
{"Бумага Шахты Утренняя Звезда", {288, 41}, {48}, 0, 1, },
{"Святая ручная граната", {289, 122}, {48}, 2, 1, },
{"Чип Экскаватора", {290, 48}, {48}, 1, 50, },
{"Золотой Самородок", {291, 165}, {48}, 10, 50, },
{"Кусок Монумента", {292, 53}, {48}, 5, 0, },
{"Урановая руда", {293, 165}, {48}, 10, 0, },
{"Огненное дыхание", {294, 167}, {48}, 1, 0, },
{"Медикаменты", {295, 15}, {48}, 25, 50, },
{"Золотой зуб", {296, 41}, {48}, 0, 50, },
{"Снаряд Xовитчера", {297, 38}, {48}, 40, 20, },
{"Коробка Рамиреса, закрытая", {298, 41}, {48}, 2, 500, },
{"Коробка Рамиреса, открытая", {299, 41}, {48}, 2, 0, },
{"Зеркальные Тени", {300, 41}, {48}, 1, 20, },
{"Колода карт", {301, 41}, {48}, 1, 2, },
{"Упаковка меченых карт", {302, 41}, {48}, 1, 1, },
{"Ключ к Xраму", {303, 41}, {48}, 0, 0, },
{"Карманная Корпия", {305, 41}, {48}, 0, 0, },
{"Биомедицинский Гель", {304, 155}, {48}, 1, 0, },
{"Собачьи бирки Блондинки", {73, 41}, {48}, 0, 0, },
{"Собачьи бирки Ангельских Глазок", {73, 41}, {48}, 0, 0, },
{"Собачьи бирки Туко", {73, 41}, {48}, 0, 0, },
{"Карта Рейдеров", {307, 41}, {48}, 1, 0, },
{"Значок Шерифа", {308, 41}, {48}, 1, 5, },
{"Планы Вертиберда", {309, 41}, {48}, 0, 0, },
{"Голодиск Бишопа.", {75, 41}, {48}, 1, 50, },
{"Бухгалтерская книга", {310, 41}, {48}, 2, 0, },
{"Неиспользованно", {306, 173}, {48}, 1, 0, },
{"Обрывок Бумаги 1", {311, 41}, {48}, 0, 0, },
{"Обрывок Бумаги 2", {312, 41}, {48}, 0, 0, },
{"Обрывок Бумаги 3", {313, 41}, {48}, 0, 0, },
{"Бумажка с Паролем", {314, 41}, {48}, 0, 0, },
{"Взрыватель", {131, 41}, {48}, 5, 0, },
{"Ключ от Камеры", {320, 41}, {48}, 0, 0, },
{"Xабологистический Полевой Рапорт", {316, 41}, {48}, 1, 0, },
{"М.Б. Голодиск 5", {75, 41}, {48}, 1, 50, },
{"М.Б. Голодиск 1", {75, 41}, {48}, 1, 50, },
{"М.Б. Голодиск 2", {75, 41}, {48}, 1, 50, },
{"М.Б. Голодиск 3", {75, 41}, {48}, 1, 50, },
{"М.Б. Голодиск 4", {75, 41}, {48}, 1, 50, },
{"Голодиск Эвакуации", {75, 41}, {48}, 1, 50, },
{"Голодиск Эксперимента", {75, 41}, {48}, 1, 50, },
{"Голодиск Медицины", {75, 41}, {48}, 1, 50, },
{"Бумажка с Паролем", {335, 41}, {48}, 1, 5, },
{"Еда Смитти", {317, 41}, {48}, 3, 0, },
{"Гнилая Кишка", {321, 116}, {48}, 0, 5, },
{"Шаровой Кляп", {322, 41}, {48}, 2, 20, },
{"\"Цветок Лаванды\"", {323, 13}, {48}, 2, 0, },
{"Xабологистический Голодиск", {75, 41}, {48}, 1, 50, },
{"Мутировавший Палец Ноги", {324, 15}, {48}, 1, 0, },
{"Дэйзис", {325, 14}, {48}, 5, 0, },
{"Неиспользованно", {306, 173}, {48}, 0, 0, },
{"Чье-то Подсвеченное письмо", {336, 41}, {48}, 0, 0, },
{"Голодиск Радиовещания", {75, 41}, {48}, 1, 50, },
{"Голодиск Миссии Сиерра", {75, 41}, {48}, 1, 50, },
{"Запчасти от НавКома", {337, 41}, {48}, 1, 0, },
{"Бонус +1 Ловкость", {339, 15}, {48}, 0, 0, },
{"Бонус +1 Интеллект", {340, 15}, {48}, 0, 0, },
{"Бонус +1 Сила", {341, 15}, {48}, 0, 0, },
{"Книга подсказок по Возрождению 2", {342, 13}, {48}, 0, 0, },
{"Ухо Игрока", {343, 41}, {48}, 0, 0, },
{"Ухо Мастикатора", {344, 41}, {48}, 0, 750, },
{"Обогащенная урановая руда", {293, 165}, {48}, 15, 0, },
{"Записка от Франциска", {334, 41}, {48}, 0, 0, },
{"Мотиватор К-9", {68, 32}, {48}, 20, 50, },
{"Специальное оружие боксера", {345, 172}, {48}, 0, 0, },
{"Голодиск Истории НКР", {75, 41}, {48}, 1, 50, },
{"Кукла Мистера Диксона", {346, 41}, {48}, 0, 0, },
{"Обман Танкера", {347, 41}, {48}, 0, 0, },
{"Голодиск Учений", {75, 41}, {48}, 1, 50, },
{"Акция Шахт Коковиф", {348, 41}, {48}, 0, 1, },
{"Президентский Ключ Доступа", {349, 41}, {48}, 0, 0, },
{"Боксерские перчатки", {187, 47}, {48}, 5, 250, },
{"Боксерские перчатки с кастетом", {338, 47}, {48}, 10, 300, },
{"Сдвоенная Плазменная Пушка", {350, 174}, {48}, 10, 0, },
{"Лингвистический Усилитель ПипБоя", {351, 41}, {48}, 8, 200, },
{"ФН ФОЛ XПФА", {229, 36}, {48}, 10, 2250, },
{"Голубой Модуль Памяти", {352, 41}, {48}, 0, 0, },
{"Зеленый Модуль Памяти", {353, 41}, {48}, 0, 0, },
{"Красный Модуль Памяти", {354, 41}, {48}, 0, 0, },
{"Желтый Модуль Памяти", {355, 41}, {48}, 0, 0, },
{"Расчленненое Тело", {356, 177}, {48}, 125, 0, },
{"Резиновая Кукла", {357, 6}, {48}, 20, 50, },
{"Подпорченная Резиновая Кукла", {358, 14}, {48}, 20, 0, },
{"Медицинский Усилитель к ПипБою", {359, 41}, {48}, 8, 200, },
{"\"Маленький Иисус\"", {360, 28}, {48}, 2, 200, },
{"Сдвоеный Пулемет", {361, 184}, {48}, 10, 0, },
{"Крышки от бутылок", {362, 3}, {48}, 0, 0, },
{"Тяжелый Сдвоенный Пулемет", {361, 184}, {48}, 10, 0, },
{"Лезвие Вакизаши", {363, 28}, {48}, 3, 200, },
{"Топографическая Карта", {307, 41}, {48}, 0, 0, },
{"Одеяние Xранителя Моста", {98, 52}, {48}, 10, 5, {}, {20, {5, 8, 4, 4, 2, 0, 6}, {40, 60, 30, 50, 50, 500, 40}, {HAROBE, HAROBE}}},
{"Гипо", {364, 15}, {48}, 0, 500, },
{"Нож-убийца Босса", {365, 190}, {48}, 1, 0, },
{"Плазменная пушка Босса", {366, 191}, {48}, 1, 0, },
};
getstr_enum(item);

item::item(item_s type, int count) : type(type), count(0) {
	setcount(count);
	auto ammo_cap = getcapacity();
	auto ammo_type = getammo(0);
	if(ammo_cap)
		setammo(ammo_type, ammo_cap);
}

void item::clear() {
	*((int*)this) = 0;
}

unsigned short item::get(item_sprite_s i) const {
	return item_data[type].frame[i];
}

bool item::isweapon() const {
	return item_data[type].weapon.damage.max != 0;
}

bool item::isarmor() const {
	return item_data[type].armor.dress[0] != res::NoRes;
}

int item::getcapacity() const {
	return item_data[type].weapon.capacity;
}

int	item::getweight() const {
	return item_data[type].weight;
}

res::tokens	item::getdress(gender_s gender) const {
	return item_data[type].armor.dress[gender];
}

int	item::getminst() const {
	return item_data[type].weapon.minst;
}

bool item::ismatch(const item& it) const {
	if(type != it.type)
		return false;
	return isweapon() ?
		(ammo_count == it.ammo_count && ammo_index == it.ammo_index) : (count == it.count);
}

void item::join(item& it) {
	if(!ismatch(it))
		return;
	auto src_count = it.getcount();
	auto old_count = getcount();
	setcount(old_count + src_count);
	auto new_count = getcount();
	it.setcount(src_count - (new_count - old_count));
}

int item::getcount() const {
	if(isweapon())
		return weapon_count + 1;
	return count + 1;
}

item_s item::getammo() const {
	if(ammo_count == 0)
		return NoItem;
	return item_data[type].weapon.ammo[ammo_index];
}

bool item::setammo(item_s type, int count) {
	if(type == NoItem || count <= 0)
		return false;
	auto result_ammo_index = getammoindex(type);
	if(result_ammo_index == -1)
		return false;
	if(count > 255)
		count = 255;
	ammo_index = (unsigned char)result_ammo_index;
	ammo_count = (unsigned char)count;
	return true;
}

item_s item::getammo(int index) const {
	return item_data[type].weapon.ammo[index];
}

int	item::getammocount() const {
	if(!isweapon())
		return 0;
	return ammo_count;
}

void item::setammocount(int value) {
	if(!isweapon())
		return;
	if(value < 0)
		value = 0;
	if(value > 255) // TODO: Использовать размер магазина
		value = 255;
	ammo_count = value;
}

void item::setcount(int value) {
	if(value <= 0)
		clear();
	else if(isweapon()) {
		if(value > 32)
			value = 32;
		weapon_count = value - 1;
	} else {
		if(value > 256 * 256)
			value = 256 * 256;
		count = value - 1;
	}
}

const char*	item::getdescription() const {
	return item_data[type].description;
}

const char* item::getname() const {
	return item_data[type].name;
}

int item::getweaponindex() const {
	return item_data[type].frame[FrameWeapon];
}

int	item::getresistance(damage_s id) const {
	return item_data[type].armor.resistance[id];
}

int	item::getthreshold(damage_s id) const {
	return item_data[type].armor.threshold[id];
}

const attack_info& item::getattack() const {
	return item_data[type].weapon;
}

int	item::getammoindex(item_s ammo_type) const {
	const auto im = sizeof(item_data[type].weapon.ammo) / sizeof(item_data[type].weapon.ammo[0]);
	for(unsigned i = 0; i < im; i++) {
		if(item_data[type].weapon.ammo[i] == ammo_type)
			return i;
	}
	return -1;
}